frontend/modules/user/views/user-msg/index.php

SELECT * FROM `user` WHERE `id`='289'
---

    foreach ($recipientProvider as $itemRecipient) {
        if ($itemRecipient['recipient_id'] != Yii::$app->user->id) {
            $currentRecipient = User::findOne($itemRecipient['recipient_id']);