backend/modules/job/models/search/JobUserMapper.php

SELECT COUNT(*) FROM (SELECT COUNT(*) AS cnt FROM `job_user_mapper` WHERE (`status`='Booked') AND (`user_id`=320) GROUP BY `job_id`) `c`
---
    public function getRolecallCount($status,$user_id){
        $query = JobUserMapperModel::find()
            ->select(['COUNT(*) AS cnt'])
            ->where(['status'=>$status,'user_id'=>$user_id])
            ->groupBy(['job_id'])
            ->count();

SELECT COUNT(*) FROM (SELECT COUNT(*) AS cnt FROM `job_user_mapper` WHERE (`status`='Approved') AND (`job_id` IS NULL) GROUP BY `user_id`) `c`
---
    public function getTalentCount($status,$job_id){
        $query = JobUserMapperModel::find()
            ->select(['COUNT(*) AS cnt'])
            ->where(['status'=>$status,'job_id'=>$job_id])
            ->groupBy(['user_id'])
            ->count();

SELECT COUNT(*) FROM `job_user_mapper` WHERE (`status`='Booked') AND (`user_id`='289')
---
    public static function getBookedTalentCount($status,$user_id){
        $query = JobUserMapperModel::find()
            ->select(['COUNT(*) AS cnt'])
            ->where(['status'=>$status,'user_id'=>$user_id])
            ->count();

SELECT COUNT(*) FROM `job_user_mapper` WHERE ((`user_id`='289') AND (`job_id`='46')) AND (`status` != 'Pending')
---
    public static function showMessage($job_id,$user_id){
        $query = JobUserMapperModel::find()
            ->select(['COUNT(*) AS cnt'])
            ->where(['user_id'=>$user_id,'job_id'=>$job_id])
            ->andWhere(['!=', 'status', 'Pending'])
            ->count();