frontend/views/rolecall/layouts/header.php

SELECT * FROM `user_profile` WHERE `user_id`=288
---

                        $logout = '<div class="logout">' . Html::beginForm(['/logout'], 'post') . Html::submitButton('Logout', ['class' => 'btn btn-link']) . Html::endForm() . '</div>';

                        $first_name = Yii::$app->user->identity->userProfile->first_name;