frontend/views/rolecall/layouts/header.php

SELECT * FROM `user_profile` WHERE `user_id`=288
---
            </span>

                            <a href="#" class="dropdown-link" data-toggle="dropdown">
                                <?=Yii::$app->user->identity->userProfile->first_name?>