frontend/modules/user/views/user/partial/_photos.php

SELECT * FROM `user_field` WHERE `field_id`=36
---
        <ul class="bxslidertwo">
        <?php foreach ($model->userFieldValues as $i => $userFieldValue){ ?>
            <?php if($userFieldValue->field->layout == $userFieldValue::SECTION_PHOTOS){
                if($userFieldValue->field->field != "profile-pic" && !empty($userFieldValue->value)){?>