frontend/modules/job/controllers/JobItemController.php

SELECT * FROM `job_field` WHERE `field_id`='37'
---

                                           $modelUpload = new Upload();
                                           $modelUpload->file = UploadedFile::getInstanceByName('UserFieldValue['.$fieldID.'][value]');
                                           $modelJobFieldValue->value = (!is_null($modelUpload->file)) ? $modelUpload->upload() :   $this->_userFile($model->userFieldValues, $modelJobFieldValue->field_id);