frontend/modules/job/controllers/JobItemController.php

SELECT * FROM `job_field` WHERE `field_id`=37
---
    protected function _findGender($model){

        $gender = '';
        foreach ($model->jobFieldValues as $i => $jobFieldValue){
            if(!empty($jobFieldValue->value) && $jobFieldValue->field->field == 'gender'){

SELECT * FROM `job_item` WHERE `job_id`='47'
---
    protected function _ownerButtons($job_id = null){

        $tpls  =  [];
        if( empty($job_id) ){

             $links  =   [
                            'Create Rolecall'       => Url::to(['create']),

                         ];

        }else{
             $links  =   [
                            'Edit'         => Url::to(['update', 'id' => $job_id]),
                         ];
            $model = JobItem::findOne(['job_id' => $job_id]);

SELECT * FROM `job_field_value` WHERE `job_id`=47
---
    public function actionUpdate($id)
    {
        $model                      = $this->findModel($id);
        $modelJobFields             = new JobField();
        $modelJobFieldValues        = $model->jobFieldValues;

        if ($model->load(Yii::$app->request->post()) ) {

DELETE FROM `job_field_value` WHERE `job_id`=47
---
                $transaction = Yii::$app->db->beginTransaction();
                try {
                   if ( $flag = $model->save(false) ) {
                        JobFieldValue::deleteAll(
                            ['job_id' => $model->job_id]
                        );

INSERT INTO `job_field_value` (`field_id`, `value`, `job_id`) VALUES (37, 'Feature Film', 47)
---
                               case 'DatePicker':
                               case 'DropdownRange':
                               case 'TextRange':
                               $modelJobFieldValue->save(false);

INSERT INTO `job_field_value` (`field_id`, `value`, `job_id`) VALUES (40, 'a:1:{i:0;s:9:\"SAG/AFTRA\";}', 47)
---
                                   if( is_array( $modelJobFieldValue->value ) && count( $modelJobFieldValue->value ) > 0) {
                                       if($modelJobFieldValue->field->is_serialize == 1){
                                           $modelJobFieldValue->value  = serialize($modelJobFieldValue->value);
                                           $modelJobFieldValue->save(false);

SELECT * FROM `job_item` WHERE `job_id`='47'
---
    public function findModel($id)
    {
        if (($model = JobItem::findOne($id)) !== null) {