frontend/modules/user/views/user-msg/partial/chat/_item.php

SELECT * FROM `user` WHERE `id`='288'
SELECT * FROM `user` WHERE `id`=288
SELECT * FROM `user_msg_attachments` WHERE (`message_id`='1') AND (`seq`='1')
---
use backend\modules\user\models\UserMsgAttachments;


$sender = User::findOne($model['sender_id']);
$userProfile = $sender->userProfile;
$auth = CommonUser::findOne($sender->id);
$attachments = UserMsgAttachments::findAll(['message_id' => $model['message_id'], 'seq' => $model['seq']]);