frontend/modules/user/views/user-msg/partial/chat/_recipient.php

use backend\modules\user\models\UserMsgAttachments;
use yii\helpers\Html;

$message = UserMsg::findOne($model['message_id']);
$sender = User::findOne($model['recipient_id']);
---
SELECT * FROM `user_msg` WHERE `message_id`='1'
SELECT * FROM `user` WHERE `id`='289'

    $message_id = Yii::$app->request->get('message_id');
}
$lastMessage = (new UserMsgSearch())->findLastMessage($model['message_id']);
$attachments = UserMsgAttachments::findAll(['message_id' => $model['message_id'], 'seq' => $lastMessage->seq]);
---
SELECT * FROM `user_msg_attachments` WHERE (`message_id`='1') AND (`seq`=1)