backend/modules/user/models/search/UserMsgSearch.php

SELECT * FROM `user_msg` WHERE (`message_id`='1') AND (`seq`=1)
---
    public function findLastMessage($message_id){

        if(is_null($message_id) || empty($message_id)) return '';
        $seq = $this->findLastSeqId($message_id);
        $query = UserMsg::find()->select('*');
        $query->andFilterWhere(['message_id' => $message_id,'seq' => $seq,]);
        return $query->one();

SELECT max(seq) as seq FROM `user_msg` WHERE `message_id`='1'
---
    public function findLastSeqId($message_id = null){

        if(is_null($message_id) || empty($message_id)) return 1;
        $query = UserMsg::find()->select('max(seq) as seq');
        $query->andFilterWhere(['message_id' => $message_id,]);
        return ($query->count() > 0) ? $query->one()->seq : 1;