backend/modules/user/models/search/UserMsgRecipientsSearch.php

    public static function showAllUnreadMsg($item_id){
        $query = self::find()
            ->select(['COUNT(*) AS cnt'])
            ->innerJoin('user_msg',
                'user_msg.message_id = user_msg_recipients.message_id
        AND `user_msg`.`seq` = `user_msg_recipients`.`seq`')
            ->where(['user_msg.item_id' => $item_id,
                'user_msg_recipients.recipient_id' => Yii::$app->user->id,
                'user_msg_recipients.status' => UserMsgRecipients::STATUS_UNREAD])
            ->count();
---
SELECT COUNT(*) FROM `user_msg_recipients` INNER JOIN `user_msg` ON user_msg.message_id = user_msg_recipients.message_id
        AND `user_msg`.`seq` = `user_msg_recipients`.`seq` WHERE (`user_msg`.`item_id`=115) AND (`user_msg_recipients`.`recipient_id`=288) AND (`user_msg_recipients`.`status`='UnRead')

    public static function showUnreadMsg($item_id, $sender_id){
        $query = self::find()
            ->select(['COUNT(*) AS cnt'])
            ->innerJoin('user_msg',
                'user_msg.message_id = user_msg_recipients.message_id
                AND `user_msg`.`seq` = `user_msg_recipients`.`seq`')
            ->where(['user_msg.item_id' => $item_id,
                'user_msg_recipients.recipient_id' => Yii::$app->user->id,
                'user_msg_recipients.status' => UserMsgRecipients::STATUS_UNREAD,
                'user_msg.sender_id' => $sender_id,
            ])
            ->count();
---
SELECT COUNT(*) FROM `user_msg_recipients` INNER JOIN `user_msg` ON user_msg.message_id = user_msg_recipients.message_id 
                AND `user_msg`.`seq` = `user_msg_recipients`.`seq` WHERE (`user_msg`.`item_id`='47') AND (`user_msg_recipients`.`recipient_id`=288) AND (`user_msg_recipients`.`status`='UnRead') AND (`user_msg`.`sender_id`=320)