backend/modules/user/models/UserMsg.php

    public function sendEmail($user_id)
    {
        $subject = Yii::t('app', 'You have new message from {name}',[ 'name'=> Yii::$app->name]);
        $email = User::findOne($user_id)->email;
---
SELECT * FROM `user` WHERE `id`=289