common/models/User.php

SELECT * FROM `user` WHERE `id`=320
---
    public function lastActiveLogin($user_id = null, $show_first=false){

        $model = (empty($user_id)) ? $this : User::findOne($user_id);