frontend/modules/job/views/job-item/partial/_btn.php

SELECT * FROM `job_user_mapper` WHERE (`job_id`=47) AND (`user_id`=288) AND (`status`='Approved')
---
use yii\helpers\Html;
use backend\modules\job\models\JobUserMapper;

$approved = JobUserMapper::findOne(['job_id' => $model->job_id, 'user_id' => Yii::$app->user->id, 'status' => 'Approved']);