frontend/modules/job/views/job-item/partial/_frm_field.php

$flds = [];
$modelJFValue = new JobFieldValue();
$role = Yii::$app->user->identity->getRoleName();
$jobFieldList = JobField::find()->where(['status' => '1'])->orderBy(['order_by' => SORT_ASC])->all();
---
SELECT * FROM `job_field` WHERE `status`='1' ORDER BY `order_by`

    // necessary for update action.
    if (!$model->isNewRecord) {
        $form->field($modelJFValue, "[{$i}]job_id")->hiddenInput(['value' => $model->job_id])->label(false);
        $modelJFValue = JobFieldValue::findOne(['job_id' => $model->job_id, 'field_id' => $modelJF->field_id]) ?? $modelJFValue;
---
SELECT * FROM `job_field_value` WHERE (`job_id`=47) AND (`field_id`=37)

                    ->label($modelJF->name);
            break;
        case 'List':
            $optionList = ArrayHelper::map($modelJF->jobFieldOptions, 'value', 'name');
---
SELECT * FROM `job_field_option` WHERE `field_id`=37


            break;
        case 'MultiList':
            $optionList = ArrayHelper::map($modelJF->jobFieldOptions, 'value', 'name');
            $modelJFValue->value = ($modelJFValue->field && is_null($modelJFValue->field->is_serialize)) ? ArrayHelper::map($modelJF->jobFieldValues, 'value_id', 'value') : @unserialize($modelJFValue->value);
---
SELECT * FROM `job_field_option` WHERE `field_id`=40
SELECT * FROM `job_field` WHERE `field_id`=40

            break;

        case 'Radio':
            $optionList = ArrayHelper::map($modelJF->jobFieldOptions, 'value', 'name');
---
SELECT * FROM `job_field_option` WHERE `field_id`=51

        case 'TextRange':
            list($name, $sufix) = explode('-', $modelJF->field);
            $fieldRanges[$name][$sufix] = $modelJF;
            $optionListRange[$modelJF->field] = ArrayHelper::map($modelJF->jobFieldOptions, 'value', 'name');
---
SELECT * FROM `job_field_option` WHERE `field_id`=56

            case 'DropdownRange':
            case 'TextRange':
                if (!$model->isNewRecord) {
                    $modelJFValueNew = JobFieldValue::findOne(['job_id' => $model->job_id, 'field_id' => $modelJF->field_id]) ?? $modelJFValue;
---
SELECT * FROM `job_field_value` WHERE (`job_id`=47) AND (`field_id`=56)