frontend/event/Notification.php

SELECT * FROM `job_item` WHERE `job_id`=47
---
    public static function handler(NotificationEvent $event){

        $model = new UserNotification();
        $modelJobItem = JobItem::findOne( $event->id );

INSERT INTO `user_notification` (`job_id`, `seq`, `sender_id`, `ip`, `text`, `status`, `category`, `time`, `identifier`) VALUES (47, 1, 288, '', 'You updated Rolecall We Need Dashing and Talented Actor for our upcoming film & this for screening.. ', 'Read', 'Email', 1503054528, 'mSUt4VqBwJRfrm_9KbBqqwM1k6mvbnbJ')
---
    protected static function addNotification($user_id, $job_id, $category,$text, $notify = NotificationEvent::STATUS_UNREAD ){

        if(empty($user_id)) return false;
        $model 				= new UserNotification();
        $model->job_id		= $job_id;
        $model->seq 		= NotificationEvent::NOTIFICATION_SEQ;
        $model->sender_id	= $user_id;
        $model->ip 			= '';
        $model->text		= $text;
        $model->status		= $notify;
        $model->category	= $category;
        $model->time		= time();
        $model->identifier	= Yii::$app->security->generateRandomString();
        return ( $model->save(false) ) ? $model : false;

INSERT INTO `user_notification_recipients` (`message_id`, `seq`, `recipient_id`, `status`, `time`) VALUES (967, 1, 288, 'Read', 1503054528)
---
    protected static function addRecipients($model, $user_id, $notify = NotificationEvent::STATUS_UNREAD ){

        if(empty($user_id)) return false;
        $modelRecipients = new UserNotificationRecipients();
        $modelRecipients->message_id 	= $model->message_id;
        $modelRecipients->seq 		 	= $model->seq;
        $modelRecipients->recipient_id 	= $user_id;
        $modelRecipients->status 		= $notify;
        $modelRecipients->time 			= time();
        return $modelRecipients->save(false);