common/rbac/CustomeRule.php

    public function maxJobsBaseOnPlan($user, $item, $params, $model = null){

        if (Yii::$app->user->isGuest) {
            throw new yii\web\NotAcceptableHttpException('Please Login, Your are not allow to create job.');
        }
        $jobs    = Yii::$app->user->identity->getJobItems()->count();
---
SELECT COUNT(*) FROM `job_item` WHERE `user_id`=288