frontend/widgets/RightTopWidget.php

    protected function _ownerButtons()
    {

        $job_id = Yii::$app->getRequest()->getQueryParam('id');
        $id = Yii::$app->user->id;
        $model = User::findOne($id);
---
SELECT * FROM `user` WHERE `id`=288