frontend/widgets/views/left-sidebar.php

{
    $job_id = Yii::$app->getRequest()->getQueryParam('id');
    if(isset($job_id)){
        $JobItem = JobItem::findOne(['job_item.name','job_id' => $job_id]);
---
SELECT * FROM `job_item` WHERE `job_id` IN ('job_item.name', '47')