frontend/modules/user/controllers/UserMsgController.php

SELECT * FROM `user_msg_recipients` WHERE (`message_id`='1') AND (`recipient_id`=288)
---
    public function _readMsg($message_id)
    {
        $msgs = UserMsgRecipients::findAll(['message_id' => $message_id, 'recipient_id' => Yii::$app->user->id]);

SELECT * FROM `user_msg` WHERE (`message_id`='1') AND (`seq`=1)
---
            if (!empty($identifier)) {

                /** get the recips first **/
                $modelMessage = UserMsg::findOne(['message_id' => $message_id, 'seq' => 1]);