frontend/modules/user/controllers/UserController.php

SELECT * FROM `user` WHERE `id`='289'
---
    public function actionDowngradeAccount(){

        Yii::$app->response->format = Response::FORMAT_JSON;
        $model = UserProfile::findOne(Yii::$app->user->id);